NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM21/MGM210L022JNF.svd
        <register>
          <name>TIMECMP1</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x017700FF</resetMask>
          <fields>
            <field>
              <name>TCMPVAL</name>
              <description>Timer comparator 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTART</name>
              <description>Timer start source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Comparator 1 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXEOF</name>
                  <description>Comparator 1 and timer are started at TX end of frame</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXC</name>
                  <description>Comparator 1 and timer are started at TX Complete</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT</name>
                  <description>Comparator 1 and timer are started at RX going going Active (default: low)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEOF</name>
                  <description>Comparator 1 and timer are started at RX end of frame</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Source used to disable comparator 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCMP1</name>
                  <description>Comparator 1 is disabled when the counter equals TCMPVAL and triggers a TCMP1 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXST</name>
                  <description>Comparator 1 is disabled at TX start TX Engine</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT</name>
                  <description>Comparator 1 is disabled on RX going going Active (default: low)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACTN</name>
                  <description>Comparator 1 is disabled on RX going Inactive</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTARTEN</name>
              <description>Restart Timer on TCMP1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the timer restarting on TCMP1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the timer restarting on TCMP1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMECMP2</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x017700FF</resetMask>
          <fields>
            <field>
              <name>TCMPVAL</name>
              <description>Timer comparator 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSTART</name>
              <description>Timer start source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Comparator 2 is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXEOF</name>
                  <description>Comparator 2 and timer are started at TX end of frame</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXC</name>
                  <description>Comparator 2 and timer are started at TX Complete</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT</name>
                  <description>Comparator 2 and timer are started at RX going going Active (default: low)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEOF</name>
                  <description>Comparator 2 and timer are started at RX end of frame</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Source used to disable comparator 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCMP2</name>
                  <description>Comparator 2 is disabled when the counter equals TCMPVAL and triggers a TCMP2 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXST</name>
                  <description>Comparator 2 is disabled at TX start TX Engine</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT</name>
                  <description>Comparator 2 is disabled on RX going going Active (default: low)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACTN</name>
                  <description>Comparator 2 is disabled on RX going Inactive</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTARTEN</name>
              <description>Restart Timer on TCMP2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the timer restarting on TCMP2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the timer restarting on TCMP2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
